brentscavity2/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (2.99333 -0 -0 2.99333 -0 2.99333);

boundaryField
{
    inletFace
    {
        type            zeroGradient;
    }
    inletWall
    {
        type            kqRWallFunction;
        value           uniform (2.99333 -0 -0 2.99333 -0 2.99333);
    }
    inletsourceFace
    {
        type            zeroGradient;
    }
    inletdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshWall
    {
        type            kqRWallFunction;
        value           uniform (2.99333 -0 -0 2.99333 -0 2.99333);
    }
    fineMeshSourceFace
    {
        type            zeroGradient;
    }
    fineMeshdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshSymmetryWall
    {
        type            symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type            zeroGradient;
    }
    fineMeshOutletBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
