brentscavity2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 4.49;

boundaryField
{
    inletFace
    {
        type            zeroGradient;
    }
    inletWall
    {
        type            kqRWallFunction;
        value uniform   4.49;
    }
    inletsourceFace
    {
        type            zeroGradient;
    }
    inletdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshWall
    {
        type            kqRWallFunction;
        value uniform   4.49;
    }
    fineMeshSourceFace
    {
        type            zeroGradient;
    }
    fineMeshdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshSymmetryWall
    {
        type            symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type            zeroGradient;
    }
    fineMeshOutletBottom
    {
        type           zeroGradient;
    }
}


// ************************************************************************* //
